[
    {
      "name": "GiftoLexia",
      "type": "web-mobile-dev",
      "description": "GiftoLexia is a startup aimed towards helping dyslexic children, it is incubated in NSRCEL, IIM, Bangalore. The app provides a list of relevant resources which aide government teachers in teaching dyslexic students.",
      "img": "GiftoLexia.png",
      "url": "https://www.github.com/shreesh5/Gifto"
    },
    {
      "name": "ASL Hand Gesture Classifier",
      "type": "machine-learning",
      "description": "Allows a user to make a request to an API with the JSON data of a sign language hand gesture video to a url and receive a JSON response containing the classification gestures of four different machine learning models. Built using: Python and Flask.",
      "img": "ASL.png",
      "url": "https://github.com/shreesh5/CSE535-Assignment2"
    },  
    {
      "name": "Stress Down",
      "type": "web-mobile-dev",
      "description": "Monitors the user's stress levels using data from a GSR sensor and provides recommendations based on location if the user's stress levels escalate beyond a threshold. Built using: Android Studio, Python and Flask.",
      "img": "StressDetectionApp.png",
      "url": "https://github.com/shreesh5/CSE535-Project"
    },
    {
      "name": "Faculty Task Management System",
      "type": "web-mobile-dev",
      "description": "A task management application that allows a user to keep a track of tasks that they have assigned to different faculty members. Built using: Angular and Firebase.",
      "img": "FacultyManagement.png",
      "url": "https://github.com/shreesh5/csedept"
    },
    {
      "name": "Project Classifier",
      "type": "machine-learning",
      "description": "A project classification web application that allows students to upload project files to a website where the project will get classified into a certain category based on the text present in its abstract. This application also allows teachers to view uploaded projects. Built using: Django.",
      "img": "ProjectClassifier.png",
      "url": "https://github.com/shreesh5/iwt"
    },
    {
      "name": "Expense Tracker",
      "type": "web-mobile-dev",
      "description": "An expense tracking application that allows users to monitor their daily expenses. Built using: React, MongoDB, Node and Express.",
      "img": "ExpenseTracker.png",
      "url": "https://github.com/shreesh5/expense-tracker-mern"
    },
    {
      "name": "Multi-Object Detection and Tracking Tool",
      "type": "machine-learning",
      "description": "A multi-object detection and tracking tool that allows users to detect vehicles using YOLO and track a fixed number of vehicles using the MEEM tracker. Built using: YOLO, MEEM, Matlab and Python.",
      "img": "MEEM.png",
      "url": "https://github.com/shreesh5/meem"
    },
    {
      "name": "Jobs",
      "type": "web-mobile-dev",
      "description": "A job search application that allows users to search for jobs in a particular location and swipe to like or dislike job listings based on job title, location, and description in Tinder like fashion. Built using: React-Native.",
      "img": "StressDetectionApp.png",
      "url": "https://github.com/shreesh5/jobs"
    },
    {
      "name": "Tracks",
      "type": "web-mobile-dev",
      "description": "A location tracking application that allows users to create and view records of their change in location over a period of time during a particular activity, for example a hike, bike ride or road trip. Built using: React-Native, MongoDB, Node and Express.",
      "img": "StressDetectionApp.png",
      "url": "https://github.com/shreesh5/tracks"
    },
    {
      "name": "Blogs",
      "type": "web-mobile-dev",
      "description": "A blog creation application that allows users to create, read, edit and delete blogs on a local JSON server. Built using: React-Native, Node and Express.",
      "img": "StressDetectionApp.png",
      "url": "https://github.com/shreesh5/blog"
    }
]